<a href="https://colab.research.google.com/github/Sanjeevuvs/python-lab/blob/main/20181COM0167_LAB3_Frames_Questions_Only_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#This code is to upload the data set from local drive into Colab
from google.colab import files
uploaded = files.upload()

Saving empdata.csv to empdata.csv

1. Create a Pandas data frame for empdata.csv

In [ ]:
import pandas as pd
data= pd.read_csv("empdata.csv");
df=pd.DataFrame(data)
df

   Empid           Ename    Salary         DOJ
0   1001          Ganesh   1000.00  10-10-2000
1   1002            Anil  23000.50   3/20/2002
2   1003          Gaurav       NaN  03-03-2002
3   1004    Hema Chandra  16500.50  09-10-2000
4   1005  Laxmi Prasanna  12000.75  10-08-2000
5   1006          Anant    9999.99  09-09-1999

2. Retrieve a range of rows

In [ ]:
df.head()

   Empid           Ename    Salary         DOJ
0   1001          Ganesh   1000.00  10-10-2000
1   1002            Anil  23000.50   3/20/2002
2   1003          Gaurav       NaN  03-03-2002
3   1004    Hema Chandra  16500.50  09-10-2000
4   1005  Laxmi Prasanna  12000.75  10-08-2000

In [ ]:
df.tail()

   Empid           Ename    Salary         DOJ
1   1002            Anil  23000.50   3/20/2002
2   1003          Gaurav       NaN  03-03-2002
3   1004    Hema Chandra  16500.50  09-10-2000
4   1005  Laxmi Prasanna  12000.75  10-08-2000
5   1006          Anant    9999.99  09-09-1999

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Empid   6 non-null      int64
 1   Ename   6 non-null      object
 2   Salary  5 non-null      float64
 3   DOJ     6 non-null      object
dtypes: float64(1), int64(1), object(2)
memory usage: 320.0+ bytes

In [ ]:
df.describe ()

             Empid        Salary
count     6.000000      5.000000
mean   1003.500000  12500.348000
std       1.870829   8139.622234
min    1001.000000   1000.000000
25%    1002.250000   9999.990000
50%    1003.500000  12000.750000
75%    1004.750000  16500.500000
max    1006.000000  23000.500000

3. To retrieve column names

In [ ]:
df.columns

Index(['Empid', 'Ename', 'Salary', 'DOJ'], dtype='object')

4. To retrieve column data

In [ ]:
df["Empid"]

0    1001
1    1002
2    1003
3    1004
4    1005
5    1006
Name: Empid, dtype: int64

5. To retrieve a set of columns

In [ ]:
df[["Empid","Ename"]]

   Empid           Ename
0   1001          Ganesh
1   1002            Anil
2   1003          Gaurav
3   1004    Hema Chandra
4   1005  Laxmi Prasanna
5   1006          Anant

In [ ]:
df1=df.append(df)
df1

   EMPID           ENAME    SALARY         DOJ
0   1001          Ganesh   1000.00  10-10-2000
1   1002            Anil  23000.50   3/20/2002
2   1003          Gaurav       NaN  03-03-2002
3   1004    Hema Chandra  16500.50  09-10-2000
4   1005  Laxmi Prasanna  12000.75  10-08-2000
5   1006          Anant    9999.99  09-09-1999
0   1001          Ganesh   1000.00  10-10-2000
1   1002            Anil  23000.50   3/20/2002
2   1003          Gaurav       NaN  03-03-2002
3   1004    Hema Chandra  16500.50  09-10-2000
4   1005  Laxmi Prasanna  12000.75  10-08-2000
5   1006          Anant    9999.99  09-09-1999

In [ ]:
df1=df1.drop_duplicates()
df1

   EMPID           ENAME    SALARY         DOJ
0   1001          Ganesh   1000.00  10-10-2000
1   1002            Anil  23000.50   3/20/2002
2   1003          Gaurav       NaN  03-03-2002
3   1004    Hema Chandra  16500.50  09-10-2000
4   1005  Laxmi Prasanna  12000.75  10-08-2000
5   1006          Anant    9999.99  09-09-1999

6. Change all column names to upper case

In [ ]:
df.columns

Index(['Empid', 'Ename', 'Salary', 'DOJ'], dtype='object')

In [ ]:
df.columns =[i.upper() for i in df.columns]
df.columns

Index(['EMPID', 'ENAME', 'SALARY', 'DOJ'], dtype='object')

In [ ]:
df.columns.str.lower()

Index(['empid', 'ename', 'salary', 'doj'], dtype='object')

7. Handling missing values

In [ ]:
print(df.isnull())
print(df.isnull().sum())

   EMPID  ENAME  SALARY    DOJ
0  False  False   False  False
1  False  False   False  False
2  False  False    True  False
3  False  False   False  False
4  False  False   False  False
5  False  False   False  False
EMPID     0
ENAME     0
SALARY    1
DOJ       0
dtype: int64

8. Find the highest and lowest salary

In [ ]:
print("the highest salary:",df["SALARY"].max())
print("the lowest salary:",df["SALARY"].min())

the highest salary: 23000.5
the lowest salary: 1000.0

9. Display the details of employees whose salary is above 20000

In [ ]:
df[df["SALARY"]>20000]

   EMPID ENAME   SALARY        DOJ
1   1002  Anil  23000.5  3/20/2002

10. Display only the id and names of employees whose salary is greater than 20000

In [ ]:
 df[df["SALARY"]>20000][["EMPID","ENAME"]]

   EMPID ENAME
1   1002  Anil

11. Display the Eid and name of the highest paid employee

In [ ]:
max_s=df["SALARY"].max()
df[["EMPID","ENAME"]] [df["SALARY"]==max_s]

   EMPID ENAME
1   1002  Anil

12.Display the enames whose salary is above the average salary

In [ ]:
 df[["ENAME"]] [df["SALARY"]>df["SALARY"].mean()]

          ENAME
1          Anil
3  Hema Chandra

13.Sort in ascending order of DOJ and store the result in another frame

In [ ]:
 df1["DOJ"]=pd.to_datetime(df1["DOJ"])
df1

   EMPID           ENAME    SALARY        DOJ
0   1001          Ganesh   1000.00 2000-10-10
1   1002            Anil  23000.50 2002-03-20
2   1003          Gaurav       NaN 2002-03-03
3   1004    Hema Chandra  16500.50 2000-09-10
4   1005  Laxmi Prasanna  12000.75 2000-10-08
5   1006          Anant    9999.99 1999-09-09

In [ ]:
df1.sort_values("DOJ",ascending = True,inplace =True)
df1

   EMPID           ENAME    SALARY        DOJ
5   1006          Anant    9999.99 1999-09-09
3   1004    Hema Chandra  16500.50 2000-09-10
4   1005  Laxmi Prasanna  12000.75 2000-10-08
0   1001          Ganesh   1000.00 2000-10-10
2   1003          Gaurav       NaN 2002-03-03
1   1002            Anil  23000.50 2002-03-20

14. Sort in descending order of dates

In [ ]:
 df1.sort_values("DOJ",ascending = False,inplace =True)
df1

   EMPID           ENAME    SALARY        DOJ
1   1002            Anil  23000.50 2002-03-20
2   1003          Gaurav       NaN 2002-03-03
0   1001          Ganesh   1000.00 2000-10-10
4   1005  Laxmi Prasanna  12000.75 2000-10-08
3   1004    Hema Chandra  16500.50 2000-09-10
5   1006          Anant    9999.99 1999-09-09

15. Sort DOJ in descending and salary in ascending order

In [ ]:
df1.sort_values(by = ["SALARY","DOJ"], ascending = [True,False],inplace = True)
df1

   EMPID           ENAME    SALARY        DOJ
0   1001          Ganesh   1000.00 2000-10-10
5   1006          Anant    9999.99 1999-09-09
4   1005  Laxmi Prasanna  12000.75 2000-10-08
3   1004    Hema Chandra  16500.50 2000-09-10
1   1002            Anil  23000.50 2002-03-20
2   1003          Gaurav       NaN 2002-03-03